In [1]:
import pandas as pd

In [2]:
# Check pandas __version__
pd.__version__

'1.3.4'

In [3]:
pd.Series(.... , .....)

C:\Users\jain1a\AppData\Local\Temp/ipykernel_13352/2031691219.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [5]:
pd.Series(index = [1,2,3,4,5],data = ['a','b',1,2,3])

1    a
2    b
3    1
4    2
5    3
dtype: object

In [ ]:
pd.Series([6,7,8,9,10],[1,2,3,4,5])

In [ ]:
# Create Series pd.Series
# 1,2,3,4,5

In [6]:
pd.Series(index=['arpit','arpit1','c','d','e'],data=[1,2,3,4,5])

arpit     1
arpit1    2
c         3
d         4
e         5
dtype: int64

In [9]:
# Series through Dictionary values. 
run_km = {"day1": 10.01, 
          "day2": 12.24, 
          "day3": 15.78}


series = pd.Series(run_km)
print(series)

day1    10.01
day2    12.24
day3    15.78
dtype: float64

In [8]:
run_km

{'day1': 10.01, 'day2': 12.24, 'day3': 15.78}

In [14]:
s = pd.Series([1,2,3,4],index=['b','a'])
s

ValueError: Length of values (4) does not match length of index (2)

In [13]:
data = {'a' : 0., 
        'b' : 1., 
        'c' : 2.}

s = pd.Series(data,index=['b','a'])


### MCQ question 

## Error index mismatch 
## Nan value 
## Value replacing 
## Random value

s

b    1.0
a    0.0
dtype: float64

In [ ]:
s

In [ ]:
s1 = pd.Series(data,index=['x','y','z'])
s1

In [ ]:
s2 = pd.Series(data,index=['b','c','d','a'])
s2

In [ ]:
s = pd.Series(10, index=[0, 1, 2, 3, 4])
print(s)

In [ ]:
# s = pd.Series([10,20], index=[0, 1, 2, 3, 4])
# print(s)

In [20]:
#Repeat the series
# Single value repeat(n)
#pd.Series(10)


# ## multiple value repeat([n,m])
pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [ ]:
# Some more functions just with tab

In [ ]:
s = pd.Series(data=[10,20,30,40,50],index=[1,2,3,4,5])

In [ ]:
s

In [ ]:
[start:end]

In [ ]:
s

In [ ]:
## Access data from Series 
#By index
#s[3]


#By first n numbers
#s[-1]


#By last n numbers (start - end-1)
#s[1:-1]


#By labeled index
#s[4]

#By multiple label index

s[[1,4]]

* Some important / most frequently used functions in pandas series

In [21]:
ser = pd.Series([1,2,-3,-4,5])
ser1 = pd.Series(['a','b','c','d','e'])

In [ ]:
ser

In [24]:
# Abs (All positive)
ser.abs()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
# Agg (aggregate values) [min....]
ser = pd.Series([1,2,3,4,5,20,100,200,-1])
ser.agg([min,max,sum])

min     -1
max    200
sum    334
dtype: int64

In [ ]:
# append (concatenate 2 series) .append(s)

In [26]:
ser1 = pd.Series([1,2,3,4,5,20,100,200,-1])
ser2 = pd.Series([10,20,30,40,50])

In [ ]:
ser1

In [ ]:
ser2

In [27]:
ser3 = ser1.append(ser2)
ser3

0      1
1      2
2      3
3      4
4      5
5     20
6    100
7    200
8     -1
0     10
1     20
2     30
3     40
4     50
dtype: int64

In [ ]:
ser3[0]

In [28]:
ser3.reset_index(drop=True)

0       1
1       2
2       3
3       4
4       5
5      20
6     100
7     200
8      -1
9      10
10     20
11     30
12     40
13     50
dtype: int64

In [31]:
# astype (change dtype of series)
ser1 = pd.Series([1,2,3,4,5,20,'a','b',40,-1])
#ser1
ser1.astype('str')
ser1

0     1
1     2
2     3
3     4
4     5
5    20
6     a
7     b
8    40
9    -1
dtype: object

In [32]:
# between (between left & right values)
ser1 = pd.Series([1,2,3,4,5,20,30,40,-1])
ser1.between(2,7)

0    False
1     True
2     True
3     True
4     True
5    False
6    False
7    False
8    False
dtype: bool

In [ ]:
# clip_lower/clip_upper (trim data - outlier treatment)

In [ ]:
ser1 = pd.Series([1,2,3,4,5,20,30,40,-1])

In [ ]:
ser1

In [ ]:
# corr (correlation between 2 series) s1.corr(s2)

### Stats part.

In [ ]:
# cumsum/cumprod
ser1 = pd.Series([1,2,3,4,5,20,30,40,-1])
#ser1.cumprod()

In [33]:
# describe (Valuable key insights at once)
ser1 = pd.Series([1,2,3,4,5,20,20,40,-1])
ser1.describe()
#dataframes

count     9.000000
mean     10.444444
std      13.574895
min      -1.000000
25%       2.000000
50%       4.000000
75%      20.000000
max      40.000000
dtype: float64

In [ ]:
# drop (by index and labels)

In [ ]:
# drop_duplicates

In [ ]:
# dropna

In [ ]:
# fillna
# dataframes.

In [ ]:
# isna / isnull
True

In [ ]:
# max/min/mean/median/mode/std

In [ ]:
# pop
ser1 = pd.Series([1,2,3,4,5,20,20,40,-1])
#dataframes.

In [ ]:
# to_list,to_frame ...

ser1 = pd.Series([1,2,3,4,5,20,20,40,-1])
ser1.to_list()

 #### Data Frames

* Rows & Columns

In [ ]:
import pandas as pd

In [34]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [35]:
# Create Dataframe
myfirstdataset = {
  'name': ["tom", "jerry", "spike",'abc','def','fgjs','dsadfa','asdskjdf'],
  'age': [10, 12, 14, 15,16,15,50,80]
}

dataframe = pd.DataFrame(myfirstdataset)
dataframe
#print(dataframe)

       name  age
0       tom   10
1     jerry   12
2     spike   14
3       abc   15
4       def   16
5      fgjs   15
6    dsadfa   50
7  asdskjdf   80

In [39]:
abc = [['tom',10],['jerry',12],['spike',14]]


df = pd.DataFrame(abc)
# 1*2 
# 2*2
# 3*2
df
# df = pd.DataFrame(abc,['a','b','c'],columns = ['Name','Age'])  #,dtype=float
# df

       0   1
0    tom  10
1  jerry  12
2  spike  14

In [37]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

1 * 2
2 * 3

# rows =  5   / 2
# columns  =  2   / 3


2 * 3

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [40]:
data = [{'a': 5, 'b': 10, 'c': 20},
        {'a': 1, 'b': 2},
        {'a': 1, 'b': 2,'c':10,'d':70}]
df = pd.DataFrame(data)
df

   a   b     c     d
0  5  10  20.0   NaN
1  1   2   NaN   NaN
2  1   2  10.0  70.0

In [ ]:
data = [{'a': 5, 'b': 10, 'c': 20},
        {'a': 1, 'b': 2},
        {'a': 1, 'b': 2,'c':10,'d':70}]
df = pd.DataFrame(data, index=['aa', 'bb', 'cc'])
df

#### Slicing - loc & iloc

* label & integer / integrr
* list of labels / list of integers
* [A:B] both included / B excluded
* loc[row_label, column_label] / iloc[row_position, column_position]

* iloc - both intgers
* loc - row can be intger/label, column - label

In [ ]:
import pandas as pd

In [49]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [ ]:
# loc[row_index , column_index]
# iloc[row_index , column_index]

# iloc - always takes  m-1 as output.

In [42]:
df.iloc[1:3,1:3]

   two  three
1   20    200
2   30    300

In [43]:
df.loc[1:3,'two':'four']

   two  three  four
1   20    200  2000
2   30    300  3000
3   40    400  4000

In [44]:
df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

In [45]:
df.loc[[0,2],['two','four']]

   two  four
0   10  1000
2   30  3000

In [46]:
df.iloc[[0,3],1:3]

# rows  = 2
# column = 2

   two  three
0   10    100
3   40    400

In [47]:
myfirstdataset = {
  'name': ["tom", "jerry", "spike",'abc','def','fgjs','dsadfa','asdskjdf'],
  'age': [10, 12, 14, 15,16,15,50,80],
'weight': [100, 121, 141, 152,161,151,50,80]
}

dataframe = pd.DataFrame(myfirstdataset)
dataframe

       name  age  weight
0       tom   10     100
1     jerry   12     121
2     spike   14     141
3       abc   15     152
4       def   16     161
5      fgjs   15     151
6    dsadfa   50      50
7  asdskjdf   80      80

In [48]:
dataframe.iloc[[1,2,0],0:1]

    name
1  jerry
2  spike
0    tom

In [ ]:
df.loc[[0,3],'two':'four']

In [50]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [51]:
# data for colum three & four where the value of column two is more than 20

df.loc[df['two'] >20, ['three','four']]

   three  four
2    300  3000
3    400  4000

In [ ]:
# data for column one & four where value of three is less than 500

In [52]:
df.loc[df['three'] < 300, ['one','four']]

   one  four
0    1  1000
1    2  2000

In [ ]:
df.iloc[0,1:3]

# 0 index value (1st row)
# data from the columns between two & four, -- two three & four

In [ ]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),}
df = pd.DataFrame(data)


# pd.read_csv

In [ ]:
df.iloc[[0,3,1],1:3]

In [ ]:
# All the rows where column two value > 20

##### ways to access columns
1. df['column name']
2. df.column_name

In [ ]:
df.loc[df['two'] >20, ['two','three']]

In [ ]:
# List of values   ##loc/iloc[:,[,]]
df.loc[[0,3,1],['one','three']]

##### Pandas Data frame computations

In [53]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)

In [54]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

* Column addition

In [55]:
# need another column 5 and pass the data externally -- name 'five'

df['five'] = pd.Series([150,250,350,450])

In [56]:
df

   one  two  three  four  five
0    1   10    100  1000   150
1    2   20    200  2000   250
2    3   30    300  3000   350
3    4   40    400  4000   450

In [57]:
df['six'] = pd.Series(['a','b','c','d'])
df

   one  two  three  four  five six
0    1   10    100  1000   150   a
1    2   20    200  2000   250   b
2    3   30    300  3000   350   c
3    4   40    400  4000   450   d

In [58]:
# Some computation on existing data
# new column seven, - multiplication of column one & two
        # 10,40,90,160
    
df['seven'] = df['one'] * df['two']
df

   one  two  three  four  five six  seven
0    1   10    100  1000   150   a     10
1    2   20    200  2000   250   b     40
2    3   30    300  3000   350   c     90
3    4   40    400  4000   450   d    160

* Column deletion

In [66]:
df

   one  two  three  four  five
0    1   10    100  1000   150
1    2   20    200  2000   250
2    3   30    300  3000   350
3    4   40    400  4000   450

In [67]:
df['eight'] = [111,222,333,444]
df

   one  two  three  four  five  eight
0    1   10    100  1000   150    111
1    2   20    200  2000   250    222
2    3   30    300  3000   350    333
3    4   40    400  4000   450    444

In [60]:
# Column Deletion
## using del function  del df['']

del df['six']
df

   one  two  three  four  five  seven
0    1   10    100  1000   150     10
1    2   20    200  2000   250     40
2    3   30    300  3000   350     90
3    4   40    400  4000   450    160

In [61]:
df.pop('seven')

0     10
1     40
2     90
3    160
Name: seven, dtype: int64

In [62]:
df

   one  two  three  four  five
0    1   10    100  1000   150
1    2   20    200  2000   250
2    3   30    300  3000   350
3    4   40    400  4000   450

#### Addition of rows (Append)

In [63]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df1

   a  b
0  1  2
1  3  4

In [64]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df2

   a  b
0  5  6
1  7  8

In [65]:
df3 = df1.append(df2).reset_index(drop=True)
df3

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [ ]:
# append df.append(df)


# Reset Index

#### Drop

In [73]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

* axis =0 => Rows (row wise)
* axis =1 => Columns (column wise)

In [71]:
df.drop(['one','three'],axis=1, inplace = True)

In [72]:
df

   two  four
0   10  1000
1   20  2000
2   30  3000
3   40  4000

In [ ]:
df = df.drop(['one','three'],axis=1)
df

In [ ]:
df.drop(columns = ['one','four'], inplace =True)

In [74]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [77]:
df.drop([0,1],axis=0)

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [ ]:
# drop columns by name & axis directly #.drop(['a','b'],axis=1)

In [ ]:
# drop columns by list of names #.drop(columns = ['a','b'])

In [ ]:
# drop single rows by index (0)

In [ ]:
# drop multiple row by list of indices ([0,1])

#### Data frame functionalities

In [78]:
d = {'Name':pd.Series(['Tom','Jerry','Spike','Popeye','Olive','Bluto','Mickey']),
   'Age':pd.Series([10,12,14,30,28,33,15]),
   'Height':pd.Series([3.25,1.11,4.12,5.47,6.15,6.67,2.61])}

df = pd.DataFrame(d)
df

     Name  Age  Height
0     Tom   10    3.25
1   Jerry   12    1.11
2   Spike   14    4.12
3  Popeye   30    5.47
4   Olive   28    6.15
5   Bluto   33    6.67
6  Mickey   15    2.61

In [79]:
# Important functionalities of DF. 

# 1. T (Transposes rows and columns.)

df.T

           0      1      2       3      4      5       6
Name     Tom  Jerry  Spike  Popeye  Olive  Bluto  Mickey
Age       10     12     14      30     28     33      15
Height  3.25   1.11   4.12    5.47   6.15   6.67    2.61

In [80]:
# 2. axes (Returns a list with the row and column axis variables)
df.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['Name', 'Age', 'Height'], dtype='object')]

In [ ]:
# 3. ndim (Number of axes)

In [81]:
df.ndim

2

In [ ]:
# 4. dtypes (Returns the dtypes of objects)

In [83]:
df

     Name  Age  Height
0     Tom   10    3.25
1   Jerry   12    1.11
2   Spike   14    4.12
3  Popeye   30    5.47
4   Olive   28    6.15
5   Bluto   33    6.67
6  Mickey   15    2.61

In [82]:
df.dtypes

Name       object
Age         int64
Height    float64
dtype: object

In [ ]:
# 5. shape (Returns the dimension of data)

In [84]:
df.shape

(7, 3)

In [ ]:
df.shape[0] ### Row element 
df.shape[1]  ### Column elemnt

In [88]:
print('My dataframe has {} rows and {} columns'.format(df.shape[0],df.shape[1]))

My dataframe has 7 rows and 3 columns

In [ ]:
df

In [86]:
# 6. head() (Returns the first n rows)
df.head(100)

     Name  Age  Height
0     Tom   10    3.25
1   Jerry   12    1.11
2   Spike   14    4.12
3  Popeye   30    5.47
4   Olive   28    6.15
5   Bluto   33    6.67
6  Mickey   15    2.61

In [ ]:
# 7. tail() (Returns last n rows.)

In [87]:
df.tail(190)

     Name  Age  Height
0     Tom   10    3.25
1   Jerry   12    1.11
2   Spike   14    4.12
3  Popeye   30    5.47
4   Olive   28    6.15
5   Bluto   33    6.67
6  Mickey   15    2.61

In [ ]:
# 8. empty() (Returns true if DF is empty)

In [ ]:
df

In [89]:
df.empty

False

In [ ]:
df

In [ ]:
## Descriptive Stats

# .sum()  (Returns sum on by default axis 0)

In [90]:
df.sum(1)

C:\Users\jain1a\AppData\Local\Temp/ipykernel_13352/681064937.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(1)

0    13.25
1    13.11
2    18.12
3    35.47
4    34.15
5    39.67
6    17.61
dtype: float64

In [ ]:
# .sum(1) (on axis =1, columns)

In [ ]:
# .mean() (Returns avg value per column)

In [91]:
df['Age'].mean()

20.285714285714285

In [ ]:
# .mode() (Returns mode value per column)

In [ ]:
# .std()  (Returns std per column)

In [ ]:
# .min()/max()/abs()/prod()

* Describe ()

In [92]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000]),
    'five' : pd.Series(['A','B','C','D'])}

df = pd.DataFrame(data)

In [94]:
df

   one  two  three  four five
0    1   10    100  1000    A
1    2   20    200  2000    B
2    3   30    300  3000    C
3    4   40    400  4000    D

In [93]:
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

In [95]:
df.describe(percentiles=[0.75,0.80,0.85,0.9,0.95,0.99])

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
80%    3.400000  34.000000  340.000000  3400.000000
85%    3.550000  35.500000  355.000000  3550.000000
90%    3.700000  37.000000  370.000000  3700.000000
95%    3.850000  38.500000  385.000000  3850.000000
99%    3.970000  39.700000  397.000000  3970.000000
max    4.000000  40.000000  400.000000  4000.000000

In [96]:
df.describe(exclude = 'number')

       five
count     4
unique    4
top       A
freq      1

In [97]:
df.describe(percentiles=[0.75,0.80,0.85,0.9,0.95,0.99], include = 'all')

             one        two       three         four five
count   4.000000   4.000000    4.000000     4.000000    4
unique       NaN        NaN         NaN          NaN    4
top          NaN        NaN         NaN          NaN    A
freq         NaN        NaN         NaN          NaN    1
mean    2.500000  25.000000  250.000000  2500.000000  NaN
std     1.290994  12.909944  129.099445  1290.994449  NaN
min     1.000000  10.000000  100.000000  1000.000000  NaN
50%     2.500000  25.000000  250.000000  2500.000000  NaN
75%     3.250000  32.500000  325.000000  3250.000000  NaN
80%     3.400000  34.000000  340.000000  3400.000000  NaN
85%     3.550000  35.500000  355.000000  3550.000000  NaN
90%     3.700000  37.000000  370.000000  3700.000000  NaN
95%     3.850000  38.500000  385.000000  3850.000000  NaN
99%     3.970000  39.700000  397.000000  3970.000000  NaN
max     4.000000  40.000000  400.000000  4000.000000  NaN

In [ ]:
# include = 'all'/'object'
#df.describe()

##### Python Functions 
 * Pipe function - table wise
 * apply function - row/column wise
 * applymap function - element wise

In [ ]:
# pipe

data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)

#df.shape
df

In [ ]:
def add_2(n,m):
    return n+m

def sub_2(n,m):
    return n-m


df.pipe(add_2,10).pipe(sub_2,5)

In [ ]:
# Apply


data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

In [ ]:
import numpy as np

In [ ]:
df.apply(np.mean)

In [ ]:
#df.apply(np.mean)

df.apply(lambda x: x.max() - x.min())

In [ ]:
## Passing column over same above 2 expressions. 

df['one'].apply(np.mean)
#df['one'].apply(lambda x: x.max() - x.min())

In [ ]:
df

In [ ]:
# applymap
df.applymap(lambda x:x*100)

* map is elementwise for Series
* applymap is elementwise for DataFrames
* apply also works elementwise but is suited to more complex operations and aggregation.

#### Reindex()

* Conform DataFrame to new index with optional filling logic

In [ ]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

In [ ]:
new_index = ['a','b',0,1]
df.reindex(new_index, columns = ['one','three','five'], fill_value = 'missing')

* reset_index()   -- does the sequence wise reseting of row index
* reindex()  -- aligns data for both rows and columns dependeing on passed info and NAN elsewise.

In [ ]:
# new_index = ['a','b',0,1]
# columns = ['one','two','five']
# df.reindex(new_index) # fill_value # method = 'ffill'/'bfill'

###### Rename ()

In [ ]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
#df
df
#   {original : changed}

In [ ]:
df.rename(columns = {'one' : 'five' , 'two' : 'six'} , index = {0:'a',1:'b'}, inplace = True)

In [ ]:
df

In [ ]:
# df.rename(columns={'one' : 'a', 'two' : 'b'},
# index = {0 : 'abcd', 1 : 'efgh', 2 : 'ijkl'})

###### Pandas Iteration
    * iteritems (key,value) pairs  - Colum wise
    * iterrows (index,series) over rows
    * itertuples - over rows - original data as view.

In [ ]:
# iteritems
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

In [ ]:
for key,value in df.iteritems():
    print(key)
    print(value)

In [ ]:
for key,value in df.iteritems():
    print(f"Index : {key}")
    print(f"Value : {value}")

In [ ]:
df=pd.DataFrame({"Name":["Arpit","Rohit"],"Age":[30,31],"Education":["M.Tech","Ph.d"]},index=['id1', 'id2'])
df

In [ ]:
for key,value in df.iterrows():
    print(key)
    print(value)

In [ ]:
for key,value in df.iteritems():
    print(key)
    print(value)

In [ ]:
for key,value in df.iterrows():
    print(key,value)

In [ ]:
for key,value in df.iterrows():
    print(key,value[0])

In [ ]:
import numpy as np

df=pd.DataFrame({"Name":["Arpit","Rohit"],"Age":[30,31],"Education":["M.Tech","Ph.d"]},index=['id1', 'id2'])

In [ ]:
df

In [ ]:
for row in df.itertuples():
    print(row)

In [ ]:
# Iteritems - Columns
# Iterrows - Rows
# IterTuples - Rows (Non Mutable) - view purpose.

In [ ]:
# for key,value in df.iteritems():
#     print(key,value)
    
#dtype intact

In [ ]:
# for key,value in df.iteritems():
#     print(f"Index : {key}, Value : {value}")

In [ ]:
# Get the 1st record 

# df=pd.DataFrame({"Name":["Arpit","Rohit"],"Age":[30,31],"Education":["M.Tech","Ph.d"]},index=['id1', 'id2'])
# df
# for column_name,data in df.iteritems():
#     print('column_name:',column_name,'data:',data[0])

In [ ]:
# iterrows

# df=pd.DataFrame({"Name":["Arpit","Rohit"],"Age":[30,31],"Education":["M.Tech","Ph.d"]},index=['id1', 'id2'])

# for index,data in df.iterrows():
#     print('index:',index,'data:',data[0])

In [ ]:
# itertuples

import numpy as np

df=pd.DataFrame({"Name":["Arpit","Rohit"],"Age":[30,31],"Education":["M.Tech","Ph.d"]},index=['id1', 'id2'])

# for row in df.itertuples():
#     print(row)

##### Sorting with Pandas

In [ ]:
import numpy as np

unsorted_df=pd.DataFrame(np.random.rand(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col1','col2'])
unsorted_df

In [ ]:
# sorted , .sort()
# sort_values()

In [ ]:
# Sort Index
sorted_df=unsorted_df.sort_index(ascending = True)
print(sorted_df)

In [ ]:
unsorted_df

In [ ]:
sorted_df = unsorted_df.sort_values(by='col1', ascending=False).reset_index(drop = True)

In [ ]:
sorted_df

In [ ]:
sorted_df = unsorted_df.sort_values(by=['col1','col2'])
sorted_df

In [ ]:
# Sort by algorithms

sorted_df = unsorted_df.sort_values(by='col1' ,kind='mergesort').reset_index(drop=True) #{'quicksort', 'mergesort', 'heapsort'}
print(sorted_df)

In [ ]:
sorted_df['col1'].std()

##### Pandas with Strings

In [ ]:
1. # lower() Converts strings to lower case.
s = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])
print(s.str.lower())

#s[0].lower()

In [ ]:
s = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])
s

In [ ]:
print(s.str.upper())

In [ ]:
2. # upper() Converts strings to upper case.
s = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])
print(s.str.upper())

In [ ]:
3 # len() Computes String length().
s = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])
print(len(s))

print(len(s[0]))

In [ ]:
4. # strip() Helps strip whitespace from both the sides.

s = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])


print(len(s[1]))
s = s.str.strip()
print(len(s[1]))
print(s[1])

In [ ]:
5. # split(' ') Splits each string with the given pattern.
s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])


s1[3].split('@')[-1]

# s1[1].split(' ')

#print(s2.str.split(' '))

# Always returns a list of split objects.

In [ ]:


string = "My name is Arpit Jain"
" ".join(string.split(" ")[::-1])

In [ ]:
string = "My name is Arpit Jain. I live in India"
len(string.split("."))

In [ ]:
print(string.split("."))

In [ ]:
import numpy as np

In [ ]:
6. # cat(sep=' ') Concatenates the elements with given separator.
s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])


print(s1.str.cat(sep='||||||||'))

In [ ]:
7. # contains(pattern) Returns True if substring there in the element, else False.
s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])
print(s2.str.contains('@'))

In [ ]:
8. # replace(a,b) Replaces the value a with the value b.

s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])

print(s1.str.replace('Arp','1234'))

# 2 arguments 
## (existing , replaced)

In [ ]:
9. # repeat(value) Repeats each element with specified number of times.

s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])
print(s1.str.repeat(3))

In [ ]:
10. # count(pattern) Returns count of appearance of pattern in each element.
s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])


print(s1.str.count('a'))
#print(s2.str.count('A'))

In [ ]:
## Directory (folder)

10 jpg 
20 tar
30 zip
15 csv
20 txt

if filename.endswith('.csv')
    print(filename)

In [ ]:
11. # startswith(pattern) Returns true if string starts with the pattern.

s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])


print(s1.str.startswith('A'))

In [ ]:
12. # endswith(pattern) Returns true if string ends with the pattern.

s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])


#print(s2.str.endswith(' '))

In [ ]:
13. # find(pattern) Returns the first position of the first occurrence of the pattern.
s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])


print(s1.str.find('A'))

In [ ]:
14.# findall(pattern) Returns a list of all occurrence of the pattern.
s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])

s2 = pd.Series([' Arpit', 'Arpit JAIN ', ' Rohit ', 'Arpit@1234 ', np.nan, '1234','ArpitJain'])


s2.str.findall('A')


# List

In [ ]:
15. # swapcase() Swaps the case lower/upper.
s1 = pd.Series(['Arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])
print(s1)
s1.str.swapcase()

In [ ]:
16. # islower() Check if strings in lower case or not.
s1 = pd.Series(['arpit', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])
s1.str.islower()

In [ ]:
17. # isupper() Check if strings in Upper case or not.
s1 = pd.Series(['ARPIT', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])
s1.str.isupper()

In [ ]:
18. # isnumeric() Check if strings is numeric case or not.
s1 = pd.Series(['ARPIT', 'Arpit JAIN', 'Rohit', 'Arpit@1234', np.nan, '1234','ArpitJain'])
s1.str.isnumeric()

#### Pandas Groupby

Groupby performs following operations 
   * Splitting the data in groups
   * Applying the compute functions 
        * Aggregations (Summary stats)
        * Transformations (Group level changes)
        * Filterations (POI)

In [ ]:
30 *5 --- (1 colum as category(5*6 unique), 4 numerical)-- 30 .
after i applied groupby 

cars 
maufact, mileage , price, length, weight seating capacity
toyota
6 rows
ford
hyundai
maruti
chevrolet


No. rows  got reduced to
    from 30 to 5 --- 
    
aggregation - mean. median, sum, max,

In [ ]:
import pandas as pd

cricket = {'Team': ['India', 'India', 'Australia', 'Australia', 'SA',
   'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
   'Rank': [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,801,891,815,776,784,834,824,758,691,883,782]}
df = pd.DataFrame(cricket)
#df

In [ ]:
df

In [ ]:
df.sort_values(by = ['Team','Year'])

    Ways to Split the data

        1. df.groupby('key')
        2. df.groupby(['key1','key2'])
        3. df.groupby(key,axis=1)

In [ ]:
df

In [ ]:
{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [ ]:
# 1st way

df.groupby('Team')   # Groupby object

## View 
df.groupby('Team').groups

###Output 
    # Dictionary 
        # Key - Group name 
        # Value

In [ ]:
df.groupby('Team')

In [ ]:
df.groupby('Team').get_group('Australia')

In [ ]:
df

In [ ]:
df.groupby(['Team','Year']).groups

In [ ]:
df.groupby(['Team','Year']).get_group(('Australia', 2014))

In [ ]:
# 2nd way 
#df.groupby(['Team','Year']).groups

    Iteration over group

In [ ]:
group = df.groupby('Team')
for key,data in group:
    print(key)
    print(data)

    Select a particular group -- get_group()

In [ ]:
group = df.groupby('Year')
group.get_group(2015)
df.groupby(['Team','Rank']).get_group(('India', 2))

* Aggregation

In [ ]:
import numpy as np
#Checking data points available per team

group = df.groupby('Team')
group.agg(np.size)

In [ ]:
# Checking multiple stats for points team wise

group = df.groupby('Team')
group['Points'].agg([np.sum, np.mean, np.std])

In [ ]:
df.groupby(['Team'])['Points'].mean()

In [ ]:
df = pd.DataFrame(np.random.rand(4,4), columns=list('abcd'))
df['group'] = [0, 0, 1, 1]
df

In [ ]:
# Multiple columns Syntax
df = pd.DataFrame(np.random.rand(4,4), columns=list('abcd'))
df['group'] = [0, 0, 1, 1]
df

df.groupby('group').agg({'a':['sum', 'max'], 
                         'b':'mean', 
                         'c':'sum', 
                         'd': lambda x: x.max() - x.min()})

In [ ]:
pd.__version__

In [ ]:
# Multiple columns named Syntax  ## Valid only for version > 0.25
df.groupby('group').agg(
             a_sum=('a', 'sum'),
             a_mean=('a', 'mean'),
             b_mean=('b', 'mean'),
             c_sum=('c', 'sum'),
             d_range=('d', lambda x: x.max() - x.min())
)

* Transform -- (Same size object as output)

In [ ]:
## Transform points column to value - mean(column)

group = df.groupby('Team')
transform_function = lambda x: (x - x.mean())
print(group['Points'].transform(transform_function))

* Filter

In [ ]:
df

In [ ]:
# Filter data where minimum data points for team is 3
group = df.groupby('Team')
df.groupby('Team').filter(lambda x: len(x) >= 3)

In [ ]:
df